html/20231209T200922--wsl-clock-is-out-of-sync-with-windows__windows_wsl.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>wsl clock is out of sync with windows</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231209T200922--wsl-clock-is-out-of-sync-with-windows__windows_wsl.html">wsl clock is out of sync with windows</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1cbd062">1. The problem</a></li>
<li><a href="#org6f8f181">2. Possible solution</a></li>
<li><a href="#orgc027c3b">3. Solution that works best for me now</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org1cbd062" class="outline-2">
<h2 id="org1cbd062"><span class="section-number-2">1.</span> The problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Having this problem -
<a href="https://stackoverflow.com/questions/65086856/wsl2-clock-is-out-of-sync-with-windows">https://stackoverflow.com/questions/65086856/wsl2-clock-is-out-of-sync-with-windows</a>
</p>

<p>
run this in powershell to confirm it:
</p>

<div class="org-src-container">
<pre class="src src-bash">Get-Date; wsl date
</pre>
</div>

<p>
You will notice two different times. They should be the same.
</p>
</div>
</div>

<div id="outline-container-org6f8f181" class="outline-2">
<h2 id="org6f8f181"><span class="section-number-2">2.</span> Possible solution</h2>
<div class="outline-text-2" id="text-2">
<p>
Solution is to run <code>sudo hwclock -s</code> command. It will sync the time. For that
moment. But time will shift again when I put the laptop to sleep.
</p>

<p>
I don want to run the command manually each time. I will make a script that
runs this command and put it in <code>.bashrc</code> so it automatically runs the script
each time I launch wsl. Should be enough?
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-10 Sun] </span></span> sudo hwclock -s is not an option.. it does not always work
when I run it.
</p>
</div>
</div>

<div id="outline-container-orgc027c3b" class="outline-2">
<h2 id="orgc027c3b"><span class="section-number-2">3.</span> Solution that works best for me now</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/microsoft/WSL/issues/8204#issuecomment-1338334154">https://github.com/microsoft/WSL/issues/8204#issuecomment-1338334154</a>
</p>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-windows.html">windows</a> <a href="https://arvydasg.github.io/devnotes/html/tag-wsl.html">wsl</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
